# 입력 숫자 N
N = int(input())

# 5kg 봉지 개수를 a, 3kg 봉지 개수를 b라고 생각
# a+b의 최솟값은 5kg 봉지를 최대로 들 수 있어야 하고 남은 무게를 3kg 봉지로 채울 수 있어야 함
# q를 N으로 나눈 5로 먼저 설정해주고 만약 남은 무게를 3으로 나눌 수 없다면 q에서 1을 빼면서 남은 무게를 3으로 나눌 수 있는지 확인
# b는 -1로 애초에 설정해둠
q = N // 5
b = -1

# q 부터 0 까지 1씩 빼면서 for문 탐색해서 조건 만족하면 바로 break
for a in range(q, -1, -1):
    # (N-5*a) 값이 3으로 나뉘어야 하므로 나머지가 0인지 확인
    if (N - 5*a) % 3 == 0:
        # 이때 b는 (N-5*a)를 3으로 나눴을 때 몫의 값과 같음
        b = (N - 5*a) // 3
        # a+b 를 출력하면 원하는 최솟값
        print(a+b)
        break

# 만약에 for문 속 조건을 만족하지 못하면 b는 그대로 -1일 것이므로 정확한 N킬로그램을 만들지 못하는 경우에 해당하고 -1 출력
if b == -1:
    print(-1)
